package lesson3;

import java.util.Arrays;

public class Main {
    public static void main(String[] args) {
        WorkShop workshop1 = new WorkShop();
        workshop1.execute();
        MansClothes[] arrM = workshop1.mansClothes();
        System.out.println(Arrays.toString(arrM));
        WomansClothes[] arrW = workshop1.womansClothes();
        System.out.println(Arrays.toString(arrW));
    }
}

//    1. Створити енум, який містить розміри одягу (XXS, XS, S, M, L).
//  Написати в ньому абстрактий метод getDescription.
//  Оверрайднути метод getDescription для всіх об'єктів енума, який повертатиме стрічку - опис розміра
//  (просто якийсь текст). Додати в енум в поле int euroSize, написати конструктор,
//  який параметром буде приймати значення для поля.
//    2. Створити інтерфейси "Чоловічий одяг" з методом "вдягнути чоловіка" і
//  "Жіночий одяг" з методом "одягнути жінку".
//    3. Створити абстрактний клас Одяг, який має такі поля: розмір одягу (використати створений енум),
//  вартість, колір.
//    4. Створити класи нащадки до класу Одяг - Футболка (реалізує також інтерфейси Чоловічий одяг і
//  Жіночий одяг), Штани (реалізує також інтерфейси Чоловічий одяг і Жіночий одяг), Плаття (реалізує інтерфейс
//  "Жіночий одяг"), Галстук (реалізує інтерфейси Чоловічий одяг).
//    5. Створити клас Ательє, який має полем масив об'єктів
//  Одяг (тобто в ньому можуть бути об'єкти усіх класів-нащадків), та 2 методи - чоловічий вибір
//  (повертає увесь ЧОЛОВІЧИЙ одяг (підказка: instanceof оператор поможе))
//  та жіночий вибір (повертає увесь ЖІНОЧИЙ одяг).